### Лабораторная работа. Базовая настройка коммутатора  
<p style="text-align: center;">Выполнил Давыдкин Д.Г.</p>

### Топология сети

![This is an image](https://github.com/Neogun/CISCO-LABS/blob/main/LAB_01/Images/Topology%20Network.jpg)

------------


### Таблица адресации
| Устройство   |  Интерфейс | IP-адрес / префикс  |
| :------------: | :------------: | :------------: |
| S1  | VLAN 1  | 192.168.1.2 /24  |
| PC-A  | NIC  | 192.168.1.10 /24  |



------------
### Задачи
**Часть 1. Проверка конфигурации коммутатора по умолчанию**
**Часть 2. Создание сети и настройка основных параметров устройства**
Настройте базовые параметры коммутатора.
Настройте IP-адрес для ПК.
**Часть 3. Проверка сетевых подключений**
- Отобразите конфигурацию устройства.
- Протестируйте сквозное соединение, отправив эхо-запрос.
- Протестируйте возможности удаленного управления с помощью Telnet.

------------
### Ход выполнения лабарторной работы
**Часть 1. Проверка конфигурации коммутатора по умолчанию**
*Шаг 1. Создание сети согласно топологии.*
a) В Cisco Packet Tracer был добавлен коммутатор Cisco 2960 и стандартный компьютер PC-A. Был подключен прямой кабель в интерфейс коммутатора FastEthernet 0/6 и соединён с компьютером. 
b)  Было осуществлено консольное подключение между коммутатором и компьютером. Подключение было проверено c PC-A.
**!~**Первоначальную настройку коммутатора можно произвести только с помощью консольного подключения, так как по умолчанию линии vty для работы по ssh или telnet не настроены, поэтому коммутатор не имеет даже адреса для подключения по данным протоколам.
*Шаг 2. Проверьте настройки коммутатора по умолчанию.*
a) Вывел текущую конфигурацию коммутатора с помощью команды команды show running-config  в привелигированном режиме.
b) Cisco 2960 имеет 24 порта FastEthernet и 2 порта GigabitEthernet. Имеется два отображаемых диапозона линий VTY, 0-4 и 5-15. Итого имеем всего 16 линий.
c) Сообщение **"startup-config is not present"** появилось, так как мой коммутатор еще не имеет конфигурации в энергонезавимой памяти, так как не было еще сохранений.
d) IP адрес для SVI VLAN 1 не назначен. Интерфейс выключен.
!
interface Vlan1
 no ip address
 shutdown
!

MAC-адрес интерфейса:
Switch#show interfaces vlan 1
Hardware is CPU Interface, address is 0004.9a29.dc13 (bia 0004.9a29.dc13)

e) Изучите IP-свойства интерфейса SVI сети VLAN 1.

Switch#**show ip interface vlan 1**
Vlan1 is administratively down, line protocol is down
  Internet protocol processing disabled
f) При включение FA0/6 на коммутаторе никаких изменений 
g) С помощью команды **show version **в привелигированном режиме узнаем дополнительные свойства коммутатора.
Операционная система на которой работает коммутатор - **Version 15.0(2)SE4**
Файл образа системы называется - **C2960 Software (C2960-LANBASEK9-M)**
Базовый MAC-адрес коммутатора - ** Base ethernet MAC Address : 00:04:9A:29:DC:13 **

h) С помощью команды **show interface fa0/6**  изучим свойства по по умолчанию интерфейса к которому подключен PC-A
Интерфейс включен, так как я включил его ранее. Для того чтобы включить интерфейс, нужно зайти на него из режим глобальной конфигурации и ввести команду **no shutdown** ( либо сокращенно **no shu**)
MAC-адрес интерфейса -   Hardware is Lance, address is 0000.0ceb.7a06 (bia 0000.0ceb.7a06) 
Настройки скорости и дуплекса заданы, как Full-duplex, 100Mb/s. 

i) Изучим параметры сети VLAN по умолчанию.
Для этого в привелегированном режиме надо написать команду** show vlan**
Имя сети по умолчанию - default.
По умолчанию все порты коммутатора находятся в VLAN 1.
VLAN 1 активна.

j) С помощью команды show flash посмотрел содержимое флеш-каталога. Имя присовенное образу Cisco IOS - 2960-lanbasek9-mz.150-2.SE4.bin .

**Часть 2. Настройка базовых параметров сетевых устройств**
*Шаг 1. Настройка базовых параметров коммутатора.*

a) В режиме глобальной конфигурации ввёл следующие команды:
- no ip domain-lookup
- hostname S1
- service password-encryption
- enable secret class
- banner motd #Unauthorized access is strictly prohibited. #

b) Назначение IP-адреса SVI VLAN 1.

S1(config)#int vlan 1
S1(config-if)#ip address 192.168.1.2 255.255.255.0

c) Настройка консольного подключения
S1(config)#line con 0
S1(config-line)#logging synchronous 
S1(config-line)#password cisco

d) Настройка линий VTY для подключения по Telnet

S1(config)#line vty 0 15
S1(config-line)#login 
S1(config-line)#password cisco
S1(config-line)#transport input telnet

Команда login нужна для выбора метода аутентификации. Доступна три варианта, использование сервера аутентификации AAA, использование локальной базы коммутатора (login local), либо просто ввод пароля без указания конкретного пользователя. (просто команда login)

*Шаг 2. Настройте IP-адрес на компьютере PC-A.*

![This is an image](https://github.com/Neogun/CISCO-LABS/blob/main/LAB_01/Images/Config%20PC-A%20ETH.jpg)

**Часть 3. Проверка сетевых подключений**
шаг 1. отобразите конфигурацию коммутатора.
a) С помощью консольного подключения просмотрим конфигурацию.
S1#show run просмотр конфигурации коммутатора.
b) Проверка параметров VLAN 1.
S1#show interface vlan 1
Vlan1 is up, line protocol is up 
Состояние VLAN  и канальный протокол находятся в режиме UP.

*Шаг 2. Протестируйте сквозное соединение, отправив эхо-запрос.*

a) ![Image](https://github.com/Neogun/CISCO-LABS/blob/main/LAB_01/Images/PING%20self%20PC-A.jpg)

b) ![Image](https://github.com/Neogun/CISCO-LABS/blob/main/LAB_01/Images/PING%20PC-A%20to%20VLAN%201.jpg)

*Шаг 3. Проверьте удаленное управление коммутатором S1.*

a-e) 

![IMAGE](https://github.com/Neogun/CISCO-LABS/blob/main/LAB_01/Images/Chapter%203.%20Step%203..jpg)

**Вопросы для повторения**
1.	Зачем необходимо настраивать пароль VTY для коммутатора?
Для защиты от несанкционированного доступа на коммутаторы.
2.	Что нужно сделать, чтобы пароли не отправлялись в незашифрованном виде?
Задавать пароли с помощью команды enable secret. И использовать протокол SSH.

**Приложение А. Инициализация и перезагрузка коммутатора**
a) Зайдём в привелигированный режим
S1>
S1>en
Password: 
S1#show flash
b) Дополнительные VLAN на коммутаторе не создавались
с-d) см. п.b 
e) Удаление загрузочной конфигурации из NVRAM
Switch# erase startup-config
Erasing the nvram filesystem will remove all configuration files! Продолжить? [confirm]
[OK]
Erase of nvram: complete
Switch#
f) Перезагрузка коммутатора для окончательной очистки конфигурации
Switch# reload
Proceed with reload? (Команда reload запускается на активном модуле, будет перезагружен весь стек. Продолжить ее выполнение?) [confirm]
g) Конфигурация успешно удалена. Загрузка коммутатора происходит с базовой пустой конфигурации.


